TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/driverlib/inc/hw_usb.h
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXFUNCADDR15
// register.
//
//*****************************************************************************
#define USB_TXFUNCADDR15_ADDR_M 0x0000007FU  // Device Address
#define USB_TXFUNCADDR15_ADDR_S 0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBADDR15
// register.
//
//*****************************************************************************
#define USB_TXHUBADDR15_ADDR_M  0x0000007FU  // Hub Address
#define USB_TXHUBADDR15_ADDR_S  0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBPORT15
// register.
//
//*****************************************************************************
#define USB_TXHUBPORT15_PORT_M  0x0000007FU  // Hub Port
#define USB_TXHUBPORT15_PORT_S  0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXFUNCADDR15
// register.
//
//*****************************************************************************
#define USB_RXFUNCADDR15_ADDR_M 0x0000007FU  // Device Address
#define USB_RXFUNCADDR15_ADDR_S 0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXHUBADDR15
// register.
//
//*****************************************************************************
#define USB_RXHUBADDR15_ADDR_M  0x0000007FU  // Hub Address
#define USB_RXHUBADDR15_ADDR_S  0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXHUBPORT15
// register.
//
//*****************************************************************************
#define USB_RXHUBPORT15_PORT_M  0x0000007FU  // Hub Port
#define USB_RXHUBPORT15_PORT_S  0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_CSRL0 register.
//
//*****************************************************************************
#define USB_CSRL0_NAKTO         0x00000080U  // NAK Timeout
#define USB_CSRL0_SETENDC       0x00000080U  // Setup End Clear
#define USB_CSRL0_STATUS        0x00000040U  // STATUS Packet
#define USB_CSRL0_RXRDYC        0x00000040U  // RXRDY Clear
#define USB_CSRL0_REQPKT        0x00000020U  // Request Packet
#define USB_CSRL0_STALL         0x00000020U  // Send Stall
#define USB_CSRL0_SETEND        0x00000010U  // Setup End
#define USB_CSRL0_ERROR         0x00000010U  // Error
#define USB_CSRL0_DATAEND       0x00000008U  // Data End
#define USB_CSRL0_SETUP         0x00000008U  // Setup Packet
#define USB_CSRL0_STALLED       0x00000004U  // Endpoint Stalled
#define USB_CSRL0_TXRDY         0x00000002U  // Transmit Packet Ready
#define USB_CSRL0_RXRDY         0x00000001U  // Receive Packet Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_CSRH0 register.
//
//*****************************************************************************
#define USB_CSRH0_DTWE          0x00000004U  // Data Toggle Write Enable
#define USB_CSRH0_DT            0x00000002U  // Data Toggle
#define USB_CSRH0_FLUSH         0x00000001U  // Flush FIFO

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_COUNT0 register.
//
//*****************************************************************************
#define USB_COUNT0_COUNT_M      0x0000007FU  // FIFO Count
#define USB_COUNT0_COUNT_S      0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TYPE0 register.
//
//*****************************************************************************
#define USB_TYPE0_SPEED_M       0x000000C0U  // Operating Speed
#define USB_TYPE0_SPEED_FULL    0x00000080U  // Full
#define USB_TYPE0_SPEED_LOW     0x000000C0U  // Low

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_NAKLMT register.
//
//*****************************************************************************
#define USB_NAKLMT_NAKLMT_M     0x0000001FU  // EP0 NAK Limit
#define USB_NAKLMT_NAKLMT_S     0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXMAXP1 register.
//
//*****************************************************************************
#define USB_TXMAXP1_MAXLOAD_M   0x000007FFU  // Maximum Payload
#define USB_TXMAXP1_MAXLOAD_S   0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRL1 register.
//
//*****************************************************************************
#define USB_TXCSRL1_NAKTO       0x00000080U  // NAK Timeout
#define USB_TXCSRL1_CLRDT       0x00000040U  // Clear Data Toggle
#define USB_TXCSRL1_STALLED     0x00000020U  // Endpoint Stalled
#define USB_TXCSRL1_STALL       0x00000010U  // Send STALL
#define USB_TXCSRL1_SETUP       0x00000010U  // Setup Packet
#define USB_TXCSRL1_FLUSH       0x00000008U  // Flush FIFO
#define USB_TXCSRL1_ERROR       0x00000004U  // Error
#define USB_TXCSRL1_UNDRN       0x00000004U  // Underrun
#define USB_TXCSRL1_FIFONE      0x00000002U  // FIFO Not Empty
#define USB_TXCSRL1_TXRDY       0x00000001U  // Transmit Packet Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRH1 register.
//
//*****************************************************************************
#define USB_TXCSRH1_AUTOSET     0x00000080U  // Auto Set
#define USB_TXCSRH1_ISO         0x00000040U  // Isochronous Transfers
#define USB_TXCSRH1_MODE        0x00000020U  // Mode
#define USB_TXCSRH1_DMAEN       0x00000010U  // DMA Request Enable
#define USB_TXCSRH1_FDT         0x00000008U  // Force Data Toggle
#define USB_TXCSRH1_DMAMOD      0x00000004U  // DMA Request Mode
#define USB_TXCSRH1_DTWE        0x00000002U  // Data Toggle Write Enable
#define USB_TXCSRH1_DT          0x00000001U  // Data Toggle

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXMAXP1 register.
//
//*****************************************************************************
#define USB_RXMAXP1_MAXLOAD_M   0x000007FFU  // Maximum Payload
#define USB_RXMAXP1_MAXLOAD_S   0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRL1 register.
//
//*****************************************************************************
#define USB_RXCSRL1_CLRDT       0x00000080U  // Clear Data Toggle
#define USB_RXCSRL1_STALLED     0x00000040U  // Endpoint Stalled
#define USB_RXCSRL1_STALL       0x00000020U  // Send STALL
#define USB_RXCSRL1_REQPKT      0x00000020U  // Request Packet
#define USB_RXCSRL1_FLUSH       0x00000010U  // Flush FIFO
#define USB_RXCSRL1_DATAERR     0x00000008U  // Data Error
#define USB_RXCSRL1_NAKTO       0x00000008U  // NAK Timeout
#define USB_RXCSRL1_OVER        0x00000004U  // Overrun
#define USB_RXCSRL1_ERROR       0x00000004U  // Error
#define USB_RXCSRL1_FULL        0x00000002U  // FIFO Full
#define USB_RXCSRL1_RXRDY       0x00000001U  // Receive Packet Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRH1 register.
//
//*****************************************************************************
#define USB_RXCSRH1_AUTOCL      0x00000080U  // Auto Clear
#define USB_RXCSRH1_AUTORQ      0x00000040U  // Auto Request
#define USB_RXCSRH1_ISO         0x00000040U  // Isochronous Transfers
#define USB_RXCSRH1_DMAEN       0x00000020U  // DMA Request Enable
#define USB_RXCSRH1_DISNYET     0x00000010U  // Disable NYET
#define USB_RXCSRH1_PIDERR      0x00000010U  // PID Error
#define USB_RXCSRH1_DMAMOD      0x00000008U  // DMA Request Mode
#define USB_RXCSRH1_DTWE        0x00000004U  // Data Toggle Write Enable
#define USB_RXCSRH1_DT          0x00000002U  // Data Toggle

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCOUNT1 register.
//
//*****************************************************************************
#define USB_RXCOUNT1_COUNT_M    0x00001FFFU  // Receive Packet Count
#define USB_RXCOUNT1_COUNT_S    0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXTYPE1 register.
//
//*****************************************************************************
#define USB_TXTYPE1_SPEED_M     0x000000C0U  // Operating Speed
#define USB_TXTYPE1_SPEED_DFLT  0x00000000U  // Default
#define USB_TXTYPE1_SPEED_FULL  0x00000080U  // Full
#define USB_TXTYPE1_SPEED_LOW   0x000000C0U  // Low
#define USB_TXTYPE1_PROTO_M     0x00000030U  // Protocol
#define USB_TXTYPE1_PROTO_CTRL  0x00000000U  // Control
#define USB_TXTYPE1_PROTO_ISOC  0x00000010U  // Isochronous
#define USB_TXTYPE1_PROTO_BULK  0x00000020U  // Bulk
#define USB_TXTYPE1_PROTO_INT   0x00000030U  // Interrupt
#define USB_TXTYPE1_TEP_M       0x0000000FU  // Target Endpoint Number
#define USB_TXTYPE1_TEP_S       0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXINTERVAL1
// register.
//
//*****************************************************************************
#define USB_TXINTERVAL1_NAKLMT_M \
                                0x000000FFU  // NAK Limit
#define USB_TXINTERVAL1_TXPOLL_M \
                                0x000000FFU  // TX Polling
#define USB_TXINTERVAL1_TXPOLL_S \
                                0U
#define USB_TXINTERVAL1_NAKLMT_S \
                                0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXTYPE1 register.
//
//*****************************************************************************
#define USB_RXTYPE1_SPEED_M     0x000000C0U  // Operating Speed
#define USB_RXTYPE1_SPEED_DFLT  0x00000000U  // Default
#define USB_RXTYPE1_SPEED_FULL  0x00000080U  // Full
#define USB_RXTYPE1_SPEED_LOW   0x000000C0U  // Low
#define USB_RXTYPE1_PROTO_M     0x00000030U  // Protocol
#define USB_RXTYPE1_PROTO_CTRL  0x00000000U  // Control
#define USB_RXTYPE1_PROTO_ISOC  0x00000010U  // Isochronous
#define USB_RXTYPE1_PROTO_BULK  0x00000020U  // Bulk
#define USB_RXTYPE1_PROTO_INT   0x00000030U  // Interrupt
#define USB_RXTYPE1_TEP_M       0x0000000FU  // Target Endpoint Number
#define USB_RXTYPE1_TEP_S       0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXINTERVAL1
// register.
//
//*****************************************************************************
#define USB_RXINTERVAL1_TXPOLL_M \
                                0x000000FFU  // RX Polling
#define USB_RXINTERVAL1_NAKLMT_M \
                                0x000000FFU  // NAK Limit
#define USB_RXINTERVAL1_TXPOLL_S \
                                0U
#define USB_RXINTERVAL1_NAKLMT_S \
                                0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXMAXP2 register.
//
//*****************************************************************************
#define USB_TXMAXP2_MAXLOAD_M   0x000007FFU  // Maximum Payload
#define USB_TXMAXP2_MAXLOAD_S   0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRL2 register.
//
//*****************************************************************************
#define USB_TXCSRL2_NAKTO       0x00000080U  // NAK Timeout
#define USB_TXCSRL2_CLRDT       0x00000040U  // Clear Data Toggle
#define USB_TXCSRL2_STALLED     0x00000020U  // Endpoint Stalled
#define USB_TXCSRL2_SETUP       0x00000010U  // Setup Packet
#define USB_TXCSRL2_STALL       0x00000010U  // Send STALL
#define USB_TXCSRL2_FLUSH       0x00000008U  // Flush FIFO
#define USB_TXCSRL2_ERROR       0x00000004U  // Error
#define USB_TXCSRL2_UNDRN       0x00000004U  // Underrun
#define USB_TXCSRL2_FIFONE      0x00000002U  // FIFO Not Empty
#define USB_TXCSRL2_TXRDY       0x00000001U  // Transmit Packet Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRH2 register.
//
//*****************************************************************************
#define USB_TXCSRH2_AUTOSET     0x00000080U  // Auto Set
#define USB_TXCSRH2_ISO         0x00000040U  // Isochronous Transfers
#define USB_TXCSRH2_MODE        0x00000020U  // Mode
#define USB_TXCSRH2_DMAEN       0x00000010U  // DMA Request Enable
#define USB_TXCSRH2_FDT         0x00000008U  // Force Data Toggle
#define USB_TXCSRH2_DMAMOD      0x00000004U  // DMA Request Mode
#define USB_TXCSRH2_DTWE        0x00000002U  // Data Toggle Write Enable
#define USB_TXCSRH2_DT          0x00000001U  // Data Toggle

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXMAXP2 register.
//
//*****************************************************************************
#define USB_RXMAXP2_MAXLOAD_M   0x000007FFU  // Maximum Payload
#define USB_RXMAXP2_MAXLOAD_S   0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRL2 register.
//
//*****************************************************************************
#define USB_RXCSRL2_CLRDT       0x00000080U  // Clear Data Toggle
#define USB_RXCSRL2_STALLED     0x00000040U  // Endpoint Stalled
#define USB_RXCSRL2_REQPKT      0x00000020U  // Request Packet
#define USB_RXCSRL2_STALL       0x00000020U  // Send STALL
#define USB_RXCSRL2_FLUSH       0x00000010U  // Flush FIFO
#define USB_RXCSRL2_DATAERR     0x00000008U  // Data Error
#define USB_RXCSRL2_NAKTO       0x00000008U  // NAK Timeout
#define USB_RXCSRL2_ERROR       0x00000004U  // Error
#define USB_RXCSRL2_OVER        0x00000004U  // Overrun
#define USB_RXCSRL2_FULL        0x00000002U  // FIFO Full
#define USB_RXCSRL2_RXRDY       0x00000001U  // Receive Packet Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRH2 register.
//
//*****************************************************************************
#define USB_RXCSRH2_AUTOCL      0x00000080U  // Auto Clear
#define USB_RXCSRH2_AUTORQ      0x00000040U  // Auto Request
#define USB_RXCSRH2_ISO         0x00000040U  // Isochronous Transfers
#define USB_RXCSRH2_DMAEN       0x00000020U  // DMA Request Enable
#define USB_RXCSRH2_DISNYET     0x00000010U  // Disable NYET
#define USB_RXCSRH2_PIDERR      0x00000010U  // PID Error
#define USB_RXCSRH2_DMAMOD      0x00000008U  // DMA Request Mode
#define USB_RXCSRH2_DTWE        0x00000004U  // Data Toggle Write Enable
#define USB_RXCSRH2_DT          0x00000002U  // Data Toggle

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCOUNT2 register.
//
//*****************************************************************************
#define USB_RXCOUNT2_COUNT_M    0x00001FFFU  // Receive Packet Count
#define USB_RXCOUNT2_COUNT_S    0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXTYPE2 register.
//
//*****************************************************************************
#define USB_TXTYPE2_SPEED_M     0x000000C0U  // Operating Speed
#define USB_TXTYPE2_SPEED_DFLT  0x00000000U  // Default
#define USB_TXTYPE2_SPEED_FULL  0x00000080U  // Full
#define USB_TXTYPE2_SPEED_LOW   0x000000C0U  // Low
#define USB_TXTYPE2_PROTO_M     0x00000030U  // Protocol
#define USB_TXTYPE2_PROTO_CTRL  0x00000000U  // Control
#define USB_TXTYPE2_PROTO_ISOC  0x00000010U  // Isochronous
#define USB_TXTYPE2_PROTO_BULK  0x00000020U  // Bulk
#define USB_TXTYPE2_PROTO_INT   0x00000030U  // Interrupt
#define USB_TXTYPE2_TEP_M       0x0000000FU  // Target Endpoint Number
#define USB_TXTYPE2_TEP_S       0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXINTERVAL2
// register.
//
//*****************************************************************************
#define USB_TXINTERVAL2_TXPOLL_M \
                                0x000000FFU  // TX Polling
#define USB_TXINTERVAL2_NAKLMT_M \
                                0x000000FFU  // NAK Limit
#define USB_TXINTERVAL2_NAKLMT_S \
                                0U
#define USB_TXINTERVAL2_TXPOLL_S \
                                0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXTYPE2 register.
//
//*****************************************************************************
#define USB_RXTYPE2_SPEED_M     0x000000C0U  // Operating Speed
#define USB_RXTYPE2_SPEED_DFLT  0x00000000U  // Default
#define USB_RXTYPE2_SPEED_FULL  0x00000080U  // Full
#define USB_RXTYPE2_SPEED_LOW   0x000000C0U  // Low
#define USB_RXTYPE2_PROTO_M     0x00000030U  // Protocol
#define USB_RXTYPE2_PROTO_CTRL  0x00000000U  // Control
#define USB_RXTYPE2_PROTO_ISOC  0x00000010U  // Isochronous
#define USB_RXTYPE2_PROTO_BULK  0x00000020U  // Bulk
#define USB_RXTYPE2_PROTO_INT   0x00000030U  // Interrupt
#define USB_RXTYPE2_TEP_M       0x0000000FU  // Target Endpoint Number
#define USB_RXTYPE2_TEP_S       0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXINTERVAL2
// register.
//
//*****************************************************************************
#define USB_RXINTERVAL2_TXPOLL_M \
                                0x000000FFU  // RX Polling
#define USB_RXINTERVAL2_NAKLMT_M \
                                0x000000FFU  // NAK Limit
#define USB_RXINTERVAL2_TXPOLL_S \
                                0U
#define USB_RXINTERVAL2_NAKLMT_S \
                                0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXMAXP3 register.
//
//*****************************************************************************
#define USB_TXMAXP3_MAXLOAD_M   0x000007FFU  // Maximum Payload
#define USB_TXMAXP3_MAXLOAD_S   0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRL3 register.
//
//*****************************************************************************
#define USB_TXCSRL3_NAKTO       0x00000080U  // NAK Timeout
#define USB_TXCSRL3_CLRDT       0x00000040U  // Clear Data Toggle
#define USB_TXCSRL3_STALLED     0x00000020U  // Endpoint Stalled
#define USB_TXCSRL3_SETUP       0x00000010U  // Setup Packet
#define USB_TXCSRL3_STALL       0x00000010U  // Send STALL
#define USB_TXCSRL3_FLUSH       0x00000008U  // Flush FIFO
#define USB_TXCSRL3_ERROR       0x00000004U  // Error
#define USB_TXCSRL3_UNDRN       0x00000004U  // Underrun
#define USB_TXCSRL3_FIFONE      0x00000002U  // FIFO Not Empty
#define USB_TXCSRL3_TXRDY       0x00000001U  // Transmit Packet Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRH3 register.
//
//*****************************************************************************
#define USB_TXCSRH3_AUTOSET     0x00000080U  // Auto Set
#define USB_TXCSRH3_ISO         0x00000040U  // Isochronous Transfers
#define USB_TXCSRH3_MODE        0x00000020U  // Mode
#define USB_TXCSRH3_DMAEN       0x00000010U  // DMA Request Enable
#define USB_TXCSRH3_FDT         0x00000008U  // Force Data Toggle
#define USB_TXCSRH3_DMAMOD      0x00000004U  // DMA Request Mode
#define USB_TXCSRH3_DTWE        0x00000002U  // Data Toggle Write Enable
#define USB_TXCSRH3_DT          0x00000001U  // Data Toggle

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXMAXP3 register.
//
//*****************************************************************************
#define USB_RXMAXP3_MAXLOAD_M   0x000007FFU  // Maximum Payload
#define USB_RXMAXP3_MAXLOAD_S   0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRL3 register.
//
//*****************************************************************************
#define USB_RXCSRL3_CLRDT       0x00000080U  // Clear Data Toggle
#define USB_RXCSRL3_STALLED     0x00000040U  // Endpoint Stalled
#define USB_RXCSRL3_STALL       0x00000020U  // Send STALL
#define USB_RXCSRL3_REQPKT      0x00000020U  // Request Packet
#define USB_RXCSRL3_FLUSH       0x00000010U  // Flush FIFO
#define USB_RXCSRL3_DATAERR     0x00000008U  // Data Error
#define USB_RXCSRL3_NAKTO       0x00000008U  // NAK Timeout
#define USB_RXCSRL3_ERROR       0x00000004U  // Error
#define USB_RXCSRL3_OVER        0x00000004U  // Overrun
#define USB_RXCSRL3_FULL        0x00000002U  // FIFO Full
#define USB_RXCSRL3_RXRDY       0x00000001U  // Receive Packet Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRH3 register.
//
//*****************************************************************************
#define USB_RXCSRH3_AUTOCL      0x00000080U  // Auto Clear
#define USB_RXCSRH3_AUTORQ      0x00000040U  // Auto Request
#define USB_RXCSRH3_ISO         0x00000040U  // Isochronous Transfers
#define USB_RXCSRH3_DMAEN       0x00000020U  // DMA Request Enable
#define USB_RXCSRH3_DISNYET     0x00000010U  // Disable NYET
#define USB_RXCSRH3_PIDERR      0x00000010U  // PID Error
#define USB_RXCSRH3_DMAMOD      0x00000008U  // DMA Request Mode
#define USB_RXCSRH3_DTWE        0x00000004U  // Data Toggle Write Enable
#define USB_RXCSRH3_DT          0x00000002U  // Data Toggle

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCOUNT3 register.
//
//*****************************************************************************
#define USB_RXCOUNT3_COUNT_M    0x00001FFFU  // Receive Packet Count
#define USB_RXCOUNT3_COUNT_S    0U

