TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/driverlib/inc/hw_usb.h
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRL10 register.
//
//*****************************************************************************
#define USB_TXCSRL10_NAKTO      0x00000080U  // NAK Timeout
#define USB_TXCSRL10_CLRDT      0x00000040U  // Clear Data Toggle
#define USB_TXCSRL10_STALLED    0x00000020U  // Endpoint Stalled
#define USB_TXCSRL10_SETUP      0x00000010U  // Setup Packet
#define USB_TXCSRL10_STALL      0x00000010U  // Send STALL
#define USB_TXCSRL10_FLUSH      0x00000008U  // Flush FIFO
#define USB_TXCSRL10_UNDRN      0x00000004U  // Underrun
#define USB_TXCSRL10_ERROR      0x00000004U  // Error
#define USB_TXCSRL10_FIFONE     0x00000002U  // FIFO Not Empty
#define USB_TXCSRL10_TXRDY      0x00000001U  // Transmit Packet Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRH10 register.
//
//*****************************************************************************
#define USB_TXCSRH10_AUTOSET    0x00000080U  // Auto Set
#define USB_TXCSRH10_ISO        0x00000040U  // Isochronous Transfers
#define USB_TXCSRH10_MODE       0x00000020U  // Mode
#define USB_TXCSRH10_DMAEN      0x00000010U  // DMA Request Enable
#define USB_TXCSRH10_FDT        0x00000008U  // Force Data Toggle
#define USB_TXCSRH10_DMAMOD     0x00000004U  // DMA Request Mode
#define USB_TXCSRH10_DTWE       0x00000002U  // Data Toggle Write Enable
#define USB_TXCSRH10_DT         0x00000001U  // Data Toggle

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXMAXP10 register.
//
//*****************************************************************************
#define USB_RXMAXP10_MAXLOAD_M  0x000007FFU  // Maximum Payload
#define USB_RXMAXP10_MAXLOAD_S  0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRL10 register.
//
//*****************************************************************************
#define USB_RXCSRL10_CLRDT      0x00000080U  // Clear Data Toggle
#define USB_RXCSRL10_STALLED    0x00000040U  // Endpoint Stalled
#define USB_RXCSRL10_STALL      0x00000020U  // Send STALL
#define USB_RXCSRL10_REQPKT     0x00000020U  // Request Packet
#define USB_RXCSRL10_FLUSH      0x00000010U  // Flush FIFO
#define USB_RXCSRL10_NAKTO      0x00000008U  // NAK Timeout
#define USB_RXCSRL10_DATAERR    0x00000008U  // Data Error
#define USB_RXCSRL10_OVER       0x00000004U  // Overrun
#define USB_RXCSRL10_ERROR      0x00000004U  // Error
#define USB_RXCSRL10_FULL       0x00000002U  // FIFO Full
#define USB_RXCSRL10_RXRDY      0x00000001U  // Receive Packet Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRH10 register.
//
//*****************************************************************************
#define USB_RXCSRH10_AUTOCL     0x00000080U  // Auto Clear
#define USB_RXCSRH10_AUTORQ     0x00000040U  // Auto Request
#define USB_RXCSRH10_ISO        0x00000040U  // Isochronous Transfers
#define USB_RXCSRH10_DMAEN      0x00000020U  // DMA Request Enable
#define USB_RXCSRH10_PIDERR     0x00000010U  // PID Error
#define USB_RXCSRH10_DISNYET    0x00000010U  // Disable NYET
#define USB_RXCSRH10_DMAMOD     0x00000008U  // DMA Request Mode
#define USB_RXCSRH10_DTWE       0x00000004U  // Data Toggle Write Enable
#define USB_RXCSRH10_DT         0x00000002U  // Data Toggle

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCOUNT10
// register.
//
//*****************************************************************************
#define USB_RXCOUNT10_COUNT_M   0x00001FFFU  // Receive Packet Count
#define USB_RXCOUNT10_COUNT_S   0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXTYPE10 register.
//
//*****************************************************************************
#define USB_TXTYPE10_SPEED_M    0x000000C0U  // Operating Speed
#define USB_TXTYPE10_SPEED_DFLT 0x00000000U  // Default
#define USB_TXTYPE10_SPEED_FULL 0x00000080U  // Full
#define USB_TXTYPE10_SPEED_LOW  0x000000C0U  // Low
#define USB_TXTYPE10_PROTO_M    0x00000030U  // Protocol
#define USB_TXTYPE10_PROTO_CTRL 0x00000000U  // Control
#define USB_TXTYPE10_PROTO_ISOC 0x00000010U  // Isochronous
#define USB_TXTYPE10_PROTO_BULK 0x00000020U  // Bulk
#define USB_TXTYPE10_PROTO_INT  0x00000030U  // Interrupt
#define USB_TXTYPE10_TEP_M      0x0000000FU  // Target Endpoint Number
#define USB_TXTYPE10_TEP_S      0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXINTERVAL10
// register.
//
//*****************************************************************************
#define USB_TXINTERVAL10_NAKLMT_M \
                                0x000000FFU  // NAK Limit
#define USB_TXINTERVAL10_TXPOLL_M \
                                0x000000FFU  // TX Polling
#define USB_TXINTERVAL10_TXPOLL_S \
                                0U
#define USB_TXINTERVAL10_NAKLMT_S \
                                0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXTYPE10 register.
//
//*****************************************************************************
#define USB_RXTYPE10_SPEED_M    0x000000C0U  // Operating Speed
#define USB_RXTYPE10_SPEED_DFLT 0x00000000U  // Default
#define USB_RXTYPE10_SPEED_FULL 0x00000080U  // Full
#define USB_RXTYPE10_SPEED_LOW  0x000000C0U  // Low
#define USB_RXTYPE10_PROTO_M    0x00000030U  // Protocol
#define USB_RXTYPE10_PROTO_CTRL 0x00000000U  // Control
#define USB_RXTYPE10_PROTO_ISOC 0x00000010U  // Isochronous
#define USB_RXTYPE10_PROTO_BULK 0x00000020U  // Bulk
#define USB_RXTYPE10_PROTO_INT  0x00000030U  // Interrupt
#define USB_RXTYPE10_TEP_M      0x0000000FU  // Target Endpoint Number
#define USB_RXTYPE10_TEP_S      0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXINTERVAL10
// register.
//
//*****************************************************************************
#define USB_RXINTERVAL10_NAKLMT_M \
                                0x000000FFU  // NAK Limit
#define USB_RXINTERVAL10_TXPOLL_M \
                                0x000000FFU  // RX Polling
#define USB_RXINTERVAL10_TXPOLL_S \
                                0U
#define USB_RXINTERVAL10_NAKLMT_S \
                                0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXMAXP11 register.
//
//*****************************************************************************
#define USB_TXMAXP11_MAXLOAD_M  0x000007FFU  // Maximum Payload
#define USB_TXMAXP11_MAXLOAD_S  0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRL11 register.
//
//*****************************************************************************
#define USB_TXCSRL11_NAKTO      0x00000080U  // NAK Timeout
#define USB_TXCSRL11_CLRDT      0x00000040U  // Clear Data Toggle
#define USB_TXCSRL11_STALLED    0x00000020U  // Endpoint Stalled
#define USB_TXCSRL11_STALL      0x00000010U  // Send STALL
#define USB_TXCSRL11_SETUP      0x00000010U  // Setup Packet
#define USB_TXCSRL11_FLUSH      0x00000008U  // Flush FIFO
#define USB_TXCSRL11_ERROR      0x00000004U  // Error
#define USB_TXCSRL11_UNDRN      0x00000004U  // Underrun
#define USB_TXCSRL11_FIFONE     0x00000002U  // FIFO Not Empty
#define USB_TXCSRL11_TXRDY      0x00000001U  // Transmit Packet Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRH11 register.
//
//*****************************************************************************
#define USB_TXCSRH11_AUTOSET    0x00000080U  // Auto Set
#define USB_TXCSRH11_ISO        0x00000040U  // Isochronous Transfers
#define USB_TXCSRH11_MODE       0x00000020U  // Mode
#define USB_TXCSRH11_DMAEN      0x00000010U  // DMA Request Enable
#define USB_TXCSRH11_FDT        0x00000008U  // Force Data Toggle
#define USB_TXCSRH11_DMAMOD     0x00000004U  // DMA Request Mode
#define USB_TXCSRH11_DTWE       0x00000002U  // Data Toggle Write Enable
#define USB_TXCSRH11_DT         0x00000001U  // Data Toggle

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXMAXP11 register.
//
//*****************************************************************************
#define USB_RXMAXP11_MAXLOAD_M  0x000007FFU  // Maximum Payload
#define USB_RXMAXP11_MAXLOAD_S  0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRL11 register.
//
//*****************************************************************************
#define USB_RXCSRL11_CLRDT      0x00000080U  // Clear Data Toggle
#define USB_RXCSRL11_STALLED    0x00000040U  // Endpoint Stalled
#define USB_RXCSRL11_STALL      0x00000020U  // Send STALL
#define USB_RXCSRL11_REQPKT     0x00000020U  // Request Packet
#define USB_RXCSRL11_FLUSH      0x00000010U  // Flush FIFO
#define USB_RXCSRL11_DATAERR    0x00000008U  // Data Error
#define USB_RXCSRL11_NAKTO      0x00000008U  // NAK Timeout
#define USB_RXCSRL11_OVER       0x00000004U  // Overrun
#define USB_RXCSRL11_ERROR      0x00000004U  // Error
#define USB_RXCSRL11_FULL       0x00000002U  // FIFO Full
#define USB_RXCSRL11_RXRDY      0x00000001U  // Receive Packet Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRH11 register.
//
//*****************************************************************************
#define USB_RXCSRH11_AUTOCL     0x00000080U  // Auto Clear
#define USB_RXCSRH11_ISO        0x00000040U  // Isochronous Transfers
#define USB_RXCSRH11_AUTORQ     0x00000040U  // Auto Request
#define USB_RXCSRH11_DMAEN      0x00000020U  // DMA Request Enable
#define USB_RXCSRH11_DISNYET    0x00000010U  // Disable NYET
#define USB_RXCSRH11_PIDERR     0x00000010U  // PID Error
#define USB_RXCSRH11_DMAMOD     0x00000008U  // DMA Request Mode
#define USB_RXCSRH11_DTWE       0x00000004U  // Data Toggle Write Enable
#define USB_RXCSRH11_DT         0x00000002U  // Data Toggle

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCOUNT11
// register.
//
//*****************************************************************************
#define USB_RXCOUNT11_COUNT_M   0x00001FFFU  // Receive Packet Count
#define USB_RXCOUNT11_COUNT_S   0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXTYPE11 register.
//
//*****************************************************************************
#define USB_TXTYPE11_SPEED_M    0x000000C0U  // Operating Speed
#define USB_TXTYPE11_SPEED_DFLT 0x00000000U  // Default
#define USB_TXTYPE11_SPEED_FULL 0x00000080U  // Full
#define USB_TXTYPE11_SPEED_LOW  0x000000C0U  // Low
#define USB_TXTYPE11_PROTO_M    0x00000030U  // Protocol
#define USB_TXTYPE11_PROTO_CTRL 0x00000000U  // Control
#define USB_TXTYPE11_PROTO_ISOC 0x00000010U  // Isochronous
#define USB_TXTYPE11_PROTO_BULK 0x00000020U  // Bulk
#define USB_TXTYPE11_PROTO_INT  0x00000030U  // Interrupt
#define USB_TXTYPE11_TEP_M      0x0000000FU  // Target Endpoint Number
#define USB_TXTYPE11_TEP_S      0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXINTERVAL11
// register.
//
//*****************************************************************************
#define USB_TXINTERVAL11_TXPOLL_M \
                                0x000000FFU  // TX Polling
#define USB_TXINTERVAL11_NAKLMT_M \
                                0x000000FFU  // NAK Limit
#define USB_TXINTERVAL11_NAKLMT_S \
                                0U
#define USB_TXINTERVAL11_TXPOLL_S \
                                0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXTYPE11 register.
//
//*****************************************************************************
#define USB_RXTYPE11_SPEED_M    0x000000C0U  // Operating Speed
#define USB_RXTYPE11_SPEED_DFLT 0x00000000U  // Default
#define USB_RXTYPE11_SPEED_FULL 0x00000080U  // Full
#define USB_RXTYPE11_SPEED_LOW  0x000000C0U  // Low
#define USB_RXTYPE11_PROTO_M    0x00000030U  // Protocol
#define USB_RXTYPE11_PROTO_CTRL 0x00000000U  // Control
#define USB_RXTYPE11_PROTO_ISOC 0x00000010U  // Isochronous
#define USB_RXTYPE11_PROTO_BULK 0x00000020U  // Bulk
#define USB_RXTYPE11_PROTO_INT  0x00000030U  // Interrupt
#define USB_RXTYPE11_TEP_M      0x0000000FU  // Target Endpoint Number
#define USB_RXTYPE11_TEP_S      0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXINTERVAL11
// register.
//
//*****************************************************************************
#define USB_RXINTERVAL11_NAKLMT_M \
                                0x000000FFU  // NAK Limit
#define USB_RXINTERVAL11_TXPOLL_M \
                                0x000000FFU  // RX Polling
#define USB_RXINTERVAL11_TXPOLL_S \
                                0U
#define USB_RXINTERVAL11_NAKLMT_S \
                                0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXMAXP12 register.
//
//*****************************************************************************
#define USB_TXMAXP12_MAXLOAD_M  0x000007FFU  // Maximum Payload
#define USB_TXMAXP12_MAXLOAD_S  0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRL12 register.
//
//*****************************************************************************
#define USB_TXCSRL12_NAKTO      0x00000080U  // NAK Timeout
#define USB_TXCSRL12_CLRDT      0x00000040U  // Clear Data Toggle
#define USB_TXCSRL12_STALLED    0x00000020U  // Endpoint Stalled
#define USB_TXCSRL12_SETUP      0x00000010U  // Setup Packet
#define USB_TXCSRL12_STALL      0x00000010U  // Send STALL
#define USB_TXCSRL12_FLUSH      0x00000008U  // Flush FIFO
#define USB_TXCSRL12_UNDRN      0x00000004U  // Underrun
#define USB_TXCSRL12_ERROR      0x00000004U  // Error
#define USB_TXCSRL12_FIFONE     0x00000002U  // FIFO Not Empty
#define USB_TXCSRL12_TXRDY      0x00000001U  // Transmit Packet Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRH12 register.
//
//*****************************************************************************
#define USB_TXCSRH12_AUTOSET    0x00000080U  // Auto Set
#define USB_TXCSRH12_ISO        0x00000040U  // Isochronous Transfers
#define USB_TXCSRH12_MODE       0x00000020U  // Mode
#define USB_TXCSRH12_DMAEN      0x00000010U  // DMA Request Enable
#define USB_TXCSRH12_FDT        0x00000008U  // Force Data Toggle
#define USB_TXCSRH12_DMAMOD     0x00000004U  // DMA Request Mode
#define USB_TXCSRH12_DTWE       0x00000002U  // Data Toggle Write Enable
#define USB_TXCSRH12_DT         0x00000001U  // Data Toggle

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXMAXP12 register.
//
//*****************************************************************************
#define USB_RXMAXP12_MAXLOAD_M  0x000007FFU  // Maximum Payload
#define USB_RXMAXP12_MAXLOAD_S  0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRL12 register.
//
//*****************************************************************************
#define USB_RXCSRL12_CLRDT      0x00000080U  // Clear Data Toggle
#define USB_RXCSRL12_STALLED    0x00000040U  // Endpoint Stalled
#define USB_RXCSRL12_STALL      0x00000020U  // Send STALL
#define USB_RXCSRL12_REQPKT     0x00000020U  // Request Packet
#define USB_RXCSRL12_FLUSH      0x00000010U  // Flush FIFO
#define USB_RXCSRL12_NAKTO      0x00000008U  // NAK Timeout
#define USB_RXCSRL12_DATAERR    0x00000008U  // Data Error
#define USB_RXCSRL12_ERROR      0x00000004U  // Error
#define USB_RXCSRL12_OVER       0x00000004U  // Overrun
#define USB_RXCSRL12_FULL       0x00000002U  // FIFO Full
#define USB_RXCSRL12_RXRDY      0x00000001U  // Receive Packet Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRH12 register.
//
//*****************************************************************************
#define USB_RXCSRH12_AUTOCL     0x00000080U  // Auto Clear
#define USB_RXCSRH12_ISO        0x00000040U  // Isochronous Transfers
#define USB_RXCSRH12_AUTORQ     0x00000040U  // Auto Request
#define USB_RXCSRH12_DMAEN      0x00000020U  // DMA Request Enable
#define USB_RXCSRH12_PIDERR     0x00000010U  // PID Error
#define USB_RXCSRH12_DISNYET    0x00000010U  // Disable NYET
#define USB_RXCSRH12_DMAMOD     0x00000008U  // DMA Request Mode
#define USB_RXCSRH12_DTWE       0x00000004U  // Data Toggle Write Enable
#define USB_RXCSRH12_DT         0x00000002U  // Data Toggle

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCOUNT12
// register.
//
//*****************************************************************************
#define USB_RXCOUNT12_COUNT_M   0x00001FFFU  // Receive Packet Count
#define USB_RXCOUNT12_COUNT_S   0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXTYPE12 register.
//
//*****************************************************************************
#define USB_TXTYPE12_SPEED_M    0x000000C0U  // Operating Speed
#define USB_TXTYPE12_SPEED_DFLT 0x00000000U  // Default
#define USB_TXTYPE12_SPEED_FULL 0x00000080U  // Full
#define USB_TXTYPE12_SPEED_LOW  0x000000C0U  // Low
#define USB_TXTYPE12_PROTO_M    0x00000030U  // Protocol
#define USB_TXTYPE12_PROTO_CTRL 0x00000000U  // Control
#define USB_TXTYPE12_PROTO_ISOC 0x00000010U  // Isochronous
#define USB_TXTYPE12_PROTO_BULK 0x00000020U  // Bulk
#define USB_TXTYPE12_PROTO_INT  0x00000030U  // Interrupt
#define USB_TXTYPE12_TEP_M      0x0000000FU  // Target Endpoint Number
#define USB_TXTYPE12_TEP_S      0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXINTERVAL12
// register.
//
//*****************************************************************************
#define USB_TXINTERVAL12_TXPOLL_M \
                                0x000000FFU  // TX Polling
#define USB_TXINTERVAL12_NAKLMT_M \
                                0x000000FFU  // NAK Limit
#define USB_TXINTERVAL12_TXPOLL_S \
                                0U
#define USB_TXINTERVAL12_NAKLMT_S \
                                0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXTYPE12 register.
//
//*****************************************************************************
#define USB_RXTYPE12_SPEED_M    0x000000C0U  // Operating Speed
#define USB_RXTYPE12_SPEED_DFLT 0x00000000U  // Default
#define USB_RXTYPE12_SPEED_FULL 0x00000080U  // Full
#define USB_RXTYPE12_SPEED_LOW  0x000000C0U  // Low
#define USB_RXTYPE12_PROTO_M    0x00000030U  // Protocol
#define USB_RXTYPE12_PROTO_CTRL 0x00000000U  // Control
#define USB_RXTYPE12_PROTO_ISOC 0x00000010U  // Isochronous
#define USB_RXTYPE12_PROTO_BULK 0x00000020U  // Bulk
#define USB_RXTYPE12_PROTO_INT  0x00000030U  // Interrupt
#define USB_RXTYPE12_TEP_M      0x0000000FU  // Target Endpoint Number
#define USB_RXTYPE12_TEP_S      0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXINTERVAL12
// register.
//
//*****************************************************************************
#define USB_RXINTERVAL12_NAKLMT_M \
                                0x000000FFU  // NAK Limit
#define USB_RXINTERVAL12_TXPOLL_M \
                                0x000000FFU  // RX Polling
#define USB_RXINTERVAL12_NAKLMT_S \
                                0U
#define USB_RXINTERVAL12_TXPOLL_S \
                                0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXMAXP13 register.
//
//*****************************************************************************
#define USB_TXMAXP13_MAXLOAD_M  0x000007FFU  // Maximum Payload
#define USB_TXMAXP13_MAXLOAD_S  0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRL13 register.
//
//*****************************************************************************
#define USB_TXCSRL13_NAKTO      0x00000080U  // NAK Timeout
#define USB_TXCSRL13_CLRDT      0x00000040U  // Clear Data Toggle
#define USB_TXCSRL13_STALLED    0x00000020U  // Endpoint Stalled
#define USB_TXCSRL13_SETUP      0x00000010U  // Setup Packet
#define USB_TXCSRL13_STALL      0x00000010U  // Send STALL
#define USB_TXCSRL13_FLUSH      0x00000008U  // Flush FIFO
#define USB_TXCSRL13_UNDRN      0x00000004U  // Underrun
#define USB_TXCSRL13_ERROR      0x00000004U  // Error
#define USB_TXCSRL13_FIFONE     0x00000002U  // FIFO Not Empty
#define USB_TXCSRL13_TXRDY      0x00000001U  // Transmit Packet Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRH13 register.
//
//*****************************************************************************
#define USB_TXCSRH13_AUTOSET    0x00000080U  // Auto Set
#define USB_TXCSRH13_ISO        0x00000040U  // Isochronous Transfers
#define USB_TXCSRH13_MODE       0x00000020U  // Mode
#define USB_TXCSRH13_DMAEN      0x00000010U  // DMA Request Enable
#define USB_TXCSRH13_FDT        0x00000008U  // Force Data Toggle
#define USB_TXCSRH13_DMAMOD     0x00000004U  // DMA Request Mode
#define USB_TXCSRH13_DTWE       0x00000002U  // Data Toggle Write Enable
#define USB_TXCSRH13_DT         0x00000001U  // Data Toggle

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXMAXP13 register.
//
//*****************************************************************************
#define USB_RXMAXP13_MAXLOAD_M  0x000007FFU  // Maximum Payload
#define USB_RXMAXP13_MAXLOAD_S  0U

