TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/driverlib/inc/hw_usb.h
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT12
// register.
//
//*****************************************************************************
#define USB_RQPKTCOUNT12_COUNT_M \
                                0x0000FFFFU  // Block Transfer Packet Count
#define USB_RQPKTCOUNT12_COUNT_S \
                                0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT13
// register.
//
//*****************************************************************************
#define USB_RQPKTCOUNT13_COUNT_M \
                                0x0000FFFFU  // Block Transfer Packet Count
#define USB_RQPKTCOUNT13_COUNT_S \
                                0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT14
// register.
//
//*****************************************************************************
#define USB_RQPKTCOUNT14_COUNT_M \
                                0x0000FFFFU  // Block Transfer Packet Count
#define USB_RQPKTCOUNT14_COUNT_S \
                                0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT15
// register.
//
//*****************************************************************************
#define USB_RQPKTCOUNT15_COUNT_M \
                                0x0000FFFFU  // Block Transfer Packet Count
#define USB_RQPKTCOUNT15_COUNT_S \
                                0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXDPKTBUFDIS
// register.
//
//*****************************************************************************
#define USB_RXDPKTBUFDIS_EP15   0x00008000U  // EP15 RX Double-Packet Buffer
                                            // Disable
#define USB_RXDPKTBUFDIS_EP14   0x00004000U  // EP14 RX Double-Packet Buffer
                                            // Disable
#define USB_RXDPKTBUFDIS_EP13   0x00002000U  // EP13 RX Double-Packet Buffer
                                            // Disable
#define USB_RXDPKTBUFDIS_EP12   0x00001000U  // EP12 RX Double-Packet Buffer
                                            // Disable
#define USB_RXDPKTBUFDIS_EP11   0x00000800U  // EP11 RX Double-Packet Buffer
                                            // Disable
#define USB_RXDPKTBUFDIS_EP10   0x00000400U  // EP10 RX Double-Packet Buffer
                                            // Disable
#define USB_RXDPKTBUFDIS_EP9    0x00000200U  // EP9 RX Double-Packet Buffer
                                            // Disable
#define USB_RXDPKTBUFDIS_EP8    0x00000100U  // EP8 RX Double-Packet Buffer
                                            // Disable
#define USB_RXDPKTBUFDIS_EP7    0x00000080U  // EP7 RX Double-Packet Buffer
                                            // Disable
#define USB_RXDPKTBUFDIS_EP6    0x00000040U  // EP6 RX Double-Packet Buffer
                                            // Disable
#define USB_RXDPKTBUFDIS_EP5    0x00000020U  // EP5 RX Double-Packet Buffer
                                            // Disable
#define USB_RXDPKTBUFDIS_EP4    0x00000010U  // EP4 RX Double-Packet Buffer
                                            // Disable
#define USB_RXDPKTBUFDIS_EP3    0x00000008U  // EP3 RX Double-Packet Buffer
                                            // Disable
#define USB_RXDPKTBUFDIS_EP2    0x00000004U  // EP2 RX Double-Packet Buffer
                                            // Disable
#define USB_RXDPKTBUFDIS_EP1    0x00000002U  // EP1 RX Double-Packet Buffer
                                            // Disable

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXDPKTBUFDIS
// register.
//
//*****************************************************************************
#define USB_TXDPKTBUFDIS_EP15   0x00008000U  // EP15 TX Double-Packet Buffer
                                            // Disable
#define USB_TXDPKTBUFDIS_EP14   0x00004000U  // EP14 TX Double-Packet Buffer
                                            // Disable
#define USB_TXDPKTBUFDIS_EP13   0x00002000U  // EP13 TX Double-Packet Buffer
                                            // Disable
#define USB_TXDPKTBUFDIS_EP12   0x00001000U  // EP12 TX Double-Packet Buffer
                                            // Disable
#define USB_TXDPKTBUFDIS_EP11   0x00000800U  // EP11 TX Double-Packet Buffer
                                            // Disable
#define USB_TXDPKTBUFDIS_EP10   0x00000400U  // EP10 TX Double-Packet Buffer
                                            // Disable
#define USB_TXDPKTBUFDIS_EP9    0x00000200U  // EP9 TX Double-Packet Buffer
                                            // Disable
#define USB_TXDPKTBUFDIS_EP8    0x00000100U  // EP8 TX Double-Packet Buffer
                                            // Disable
#define USB_TXDPKTBUFDIS_EP7    0x00000080U  // EP7 TX Double-Packet Buffer
                                            // Disable
#define USB_TXDPKTBUFDIS_EP6    0x00000040U  // EP6 TX Double-Packet Buffer
                                            // Disable
#define USB_TXDPKTBUFDIS_EP5    0x00000020U  // EP5 TX Double-Packet Buffer
                                            // Disable
#define USB_TXDPKTBUFDIS_EP4    0x00000010U  // EP4 TX Double-Packet Buffer
                                            // Disable
#define USB_TXDPKTBUFDIS_EP3    0x00000008U  // EP3 TX Double-Packet Buffer
                                            // Disable
#define USB_TXDPKTBUFDIS_EP2    0x00000004U  // EP2 TX Double-Packet Buffer
                                            // Disable
#define USB_TXDPKTBUFDIS_EP1    0x00000002U  // EP1 TX Double-Packet Buffer
                                            // Disable

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_EPC register.
//
//*****************************************************************************
#define USB_EPC_PFLTACT_M       0x00000300U  // Power Fault Action
#define USB_EPC_PFLTACT_UNCHG   0x00000000U  // Unchanged
#define USB_EPC_PFLTACT_TRIS    0x00000100U  // Tristate
#define USB_EPC_PFLTACT_LOW     0x00000200U  // Low
#define USB_EPC_PFLTACT_HIGH    0x00000300U  // High
#define USB_EPC_PFLTAEN         0x00000040U  // Power Fault Action Enable
#define USB_EPC_PFLTSEN_HIGH    0x00000020U  // Power Fault Sense
#define USB_EPC_PFLTEN          0x00000010U  // Power Fault Input Enable
#define USB_EPC_EPENDE          0x00000004U  // EPEN Drive Enable
#define USB_EPC_EPEN_M          0x00000003U  // External Power Supply Enable
                                            // Configuration
#define USB_EPC_EPEN_LOW        0x00000000U  // Power Enable Active Low
#define USB_EPC_EPEN_HIGH       0x00000001U  // Power Enable Active High
#define USB_EPC_EPEN_VBLOW      0x00000002U  // Power Enable High if VBUS Low
#define USB_EPC_EPEN_VBHIGH     0x00000003U  // Power Enable High if VBUS High

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_EPCRIS register.
//
//*****************************************************************************
#define USB_EPCRIS_PF           0x00000001U  // USB Power Fault Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_EPCIM register.
//
//*****************************************************************************
#define USB_EPCIM_PF            0x00000001U  // USB Power Fault Interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_EPCISC register.
//
//*****************************************************************************
#define USB_EPCISC_PF           0x00000001U  // USB Power Fault Interrupt Status
                                            // and Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DRRIS register.
//
//*****************************************************************************
#define USB_DRRIS_RESUME        0x00000001U  // RESUME Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DRIM register.
//
//*****************************************************************************
#define USB_DRIM_RESUME         0x00000001U  // RESUME Interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DRISC register.
//
//*****************************************************************************
#define USB_DRISC_RESUME        0x00000001U  // RESUME Interrupt Status and
                                            // Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_GPCS register.
//
//*****************************************************************************
#define USB_GPCS_DEVMODOTG      0x00000002U  // Enable Device Mode
#define USB_GPCS_DEVMOD         0x00000001U  // Device Mode

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_VDC register.
//
//*****************************************************************************
#define USB_VDC_VBDEN           0x00000001U  // VBUS Droop Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_VDCRIS register.
//
//*****************************************************************************
#define USB_VDCRIS_VD           0x00000001U  // VBUS Droop Raw Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_VDCIM register.
//
//*****************************************************************************
#define USB_VDCIM_VD            0x00000001U  // VBUS Droop Interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_VDCISC register.
//
//*****************************************************************************
#define USB_VDCISC_VD           0x00000001U  // VBUS Droop Interrupt Status and
                                            // Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_IDVRIS register.
//
//*****************************************************************************
#define USB_IDVRIS_ID           0x00000001U  // ID Valid Detect Raw Interrupt
                                            // Status

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_IDVIM register.
//
//*****************************************************************************
#define USB_IDVIM_ID            0x00000001U  // ID Valid Detect Interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_IDVISC register.
//
//*****************************************************************************
#define USB_IDVISC_ID           0x00000001U  // ID Valid Detect Interrupt Status
                                            // and Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMASEL register.
//
//*****************************************************************************
#define USB_DMASEL_DMACTX_M     0x00F00000UL  // DMA C TX Select
#define USB_DMASEL_DMACRX_M     0x000F0000UL  // DMA C RX Select
#define USB_DMASEL_DMABTX_M     0x0000F000U  // DMA B TX Select
#define USB_DMASEL_DMABRX_M     0x00000F00U  // DMA B RX Select
#define USB_DMASEL_DMAATX_M     0x000000F0U  // DMA A TX Select
#define USB_DMASEL_DMAARX_M     0x0000000FU  // DMA A RX Select
#define USB_DMASEL_DMACTX_S     20U
#define USB_DMASEL_DMACRX_S     16U
#define USB_DMASEL_DMABTX_S     12U
#define USB_DMASEL_DMABRX_S     8U
#define USB_DMASEL_DMAATX_S     4U
#define USB_DMASEL_DMAARX_S     0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_GLBINTEN register.
//
//*****************************************************************************
#define USB_GLBINTEN_INTEN      0x00000001U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_GLBINTFLG register.
//
//*****************************************************************************
#define USB_GLBINTFLG_INTFLG     0x00000001U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_GLBINTFLGCL register.
//
//*****************************************************************************
#define USB_GLBINTFLGCL_INTFLG    0x00000001U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_PP register.
//
//*****************************************************************************
#define USB_PP_ECNT_M           0x0000FF00U  // Endpoint Count
#define USB_PP_USB_M            0x000000C0U  // USB Capability
#define USB_PP_USB_DEVICE       0x00000040U  // DEVICE
#define USB_PP_USB_HOSTDEVICE   0x00000080U  // HOST
#define USB_PP_USB_OTG          0x000000C0U  // OTG
#define USB_PP_PHY              0x00000010U  // PHY Present
#define USB_PP_TYPE_M           0x0000000FU  // Controller Type
#define USB_PP_TYPE_0           0x00000000U  // The first-generation USB
                                            // controller
#define USB_PP_ECNT_S           8U

//*****************************************************************************
//
// The following definitions are deprecated.
//
//*****************************************************************************
#ifndef DEPRECATED

//*****************************************************************************
//
// The following are deprecated defines for the bit fields in the
// USB_O_TXFIFOADD register.
//
//*****************************************************************************
#define USB_TXFIFOADD_ADDR_2048 0x00000009U  // 2048
#define USB_TXFIFOADD_ADDR_1024 0x00000008U  // 1024
#define USB_TXFIFOADD_ADDR_512  0x00000007U  // 512
#define USB_TXFIFOADD_ADDR_256  0x00000006U  // 256
#define USB_TXFIFOADD_ADDR_128  0x00000005U  // 128
#define USB_TXFIFOADD_ADDR_64   0x00000004U  // 64
#define USB_TXFIFOADD_ADDR_32   0x00000003U  // 32
#define USB_TXFIFOADD_ADDR_16   0x00000002U  // 16
#define USB_TXFIFOADD_ADDR_8    0x00000001U  // 8
#define USB_TXFIFOADD_ADDR_0    0x00000000U  // 0

//*****************************************************************************
//
// The following are deprecated defines for the bit fields in the
// USB_O_RXFIFOADD register.
//
//*****************************************************************************
#define USB_RXFIFOADD_ADDR_2048 0x00000009U  // 2048
#define USB_RXFIFOADD_ADDR_1024 0x00000008U  // 1024
#define USB_RXFIFOADD_ADDR_512  0x00000007U  // 512
#define USB_RXFIFOADD_ADDR_256  0x00000006U  // 256
#define USB_RXFIFOADD_ADDR_128  0x00000005U  // 128
#define USB_RXFIFOADD_ADDR_64   0x00000004U  // 64
#define USB_RXFIFOADD_ADDR_32   0x00000003U  // 32
#define USB_RXFIFOADD_ADDR_16   0x00000002U  // 16
#define USB_RXFIFOADD_ADDR_8    0x00000001U  // 8
#define USB_RXFIFOADD_ADDR_0    0x00000000U  // 0

#endif

#endif // __HW_USB_H__
